Revit 2026 API

# TransformIsIdentity Property

---

The boolean value that indicates whether this transformation is an identity.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsIdentity { get; }
```
```vb
Public ReadOnly Property IsIdentity As Boolean
	Get
```
```cpp
public:
property bool IsIdentity {
	bool get ();
}
```
```fsharp
member IsIdentity : bool with get
```

#### Property Value

Boolean

The identity transformation does not change a point or a vector that it is applied to.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace